# Bonus: Temperature Analysis I

In [52]:
import pandas as pd
from datetime import datetime as dt

In [53]:
# "tobs" is "temperature observations"
df = pd.read_csv('../Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [54]:
# check format fro 'date' column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19550 entries, 0 to 19549
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   station  19550 non-null  object
 1   date     19550 non-null  object
 2   prcp     18103 non-null  float64
 3   tobs     19550 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 611.1+ KB

In [55]:
# Convert the date column format from string to datetime
df['date']= pd.to_datetime(df['date'])
 
# Check the format of 'Date' column. We can see it has changed to datetime64[ns]
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19550 entries, 0 to 19549
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   station  19550 non-null  object
 1   date     19550 non-null  datetime64[ns]
 2   prcp     18103 non-null  float64
 3   tobs     19550 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 611.1+ KB

In [56]:
# Set the date column as the DataFrame index
df_index_date = df.set_index("date")
df_index_date.head()

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73

In [62]:
# Drop the date column.
# Dropping the index column of a pandas.DataFrame removes the index column 
# from the DataFrame and replaces it with the standard sequential indexing.
# USE pandas.DataFrame.reset_index() TO DROP THE INDEX COLUMN OF A DATAFRAME
drop_date_df = df.copy()
drop_date_df.reset_index(drop=True, inplace=True)
drop_date_df = drop_date_df.drop(columns=['date'])
drop_date_df

           station  prcp  tobs
0      USC00519397  0.08    65
1      USC00519397  0.00    63
2      USC00519397  0.00    74
3      USC00519397  0.00    76
4      USC00519397   NaN    73
...            ...   ...   ...
19545  USC00516128  0.09    71
19546  USC00516128   NaN    78
19547  USC00516128  0.56    76
19548  USC00516128  0.50    76
19549  USC00516128  0.45    76

[19550 rows x 3 columns]

### Compare June and December data across all years

In [63]:
from scipy import stats

In [64]:
# Filter data for desired months
month_avg_df = df.groupby(df['date'].dt.strftime('%B'))['tobs'].mean()
month_avg_df

         date       tobs
0       April  72.357268
1      August  76.412454
2    December  71.041529
3    February  69.442236
4     January  68.726115
5        July  76.082408
6        June  74.944118
7       March  70.059067
8         May  73.680900
9    November  73.252688
10    October  75.391388
11  September  76.164865

In [73]:
month_avg_df = month_avg_df.reset_index()
# month_avg_df = month_avg_df.drop(columns=['index'])

month_avg_df

         date       tobs
0       April  72.357268
1      August  76.412454
2    December  71.041529
3    February  69.442236
4     January  68.726115
5        July  76.082408
6        June  74.944118
7       March  70.059067
8         May  73.680900
9    November  73.252688
10    October  75.391388
11  September  76.164865

In [66]:
# Identify the average temperature for June
june_avg = month_avg_df.loc[month_avg_df['date'] == "June", ['tobs']]
june_avg_tobs = june_avg['tobs'].values[0]
# june_avg_tobs
print(f"The average temperature for June across all available years in this sample was {june_avg_tobs}")

The average temperature for June across all available years in this sample was 74.94411764705882

In [67]:
# Identify the average temperature for December
# Identify the average temperature for June
dec_avg = month_avg_df.loc[month_avg_df['date'] == "December", ['tobs']]
dec_avg_tobs = dec_avg['tobs'].values[0]
# dec_avg_tobs
print(f"The average temperature for December across all available years in this sample was {dec_avg_tobs}")

The average temperature for December across all available years in this sample was 71.04152933421226

In [77]:
df

           station       date  prcp  tobs
0      USC00519397 2010-01-01  0.08    65
1      USC00519397 2010-01-02  0.00    63
2      USC00519397 2010-01-03  0.00    74
3      USC00519397 2010-01-04  0.00    76
4      USC00519397 2010-01-06   NaN    73
...            ...        ...   ...   ...
19545  USC00516128 2017-08-19  0.09    71
19546  USC00516128 2017-08-20   NaN    78
19547  USC00516128 2017-08-21  0.56    76
19548  USC00516128 2017-08-22  0.50    76
19549  USC00516128 2017-08-23  0.45    76

[19550 rows x 4 columns]

In [89]:
# Create collections of temperature data
# june_tobs = df(df['date'].dt.strftime('%B'))

# june_tobs = ['date', 'tobs']
# dec_tobs = ['date', 'tobs']
june_tobs = []
dec_tobs = []
june = '06'
dec = '12'

for row in df:
#     if df['date'].dt.strftime('%B') == 'June':
    if df['date'] == '2017-08-23':
        june_tobs.append(df('tobs'))
        
        #         june_tobs.append(df['tobs'])
  #     if df(['date'][5:2]) == '06':
#         june_tobs.append(df['tobs'])

# june_tobs
#                print(row)

# year = []
# for datenow in date_clean_str:
#     year.append(datenow[0:4]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [69]:
# Run paired t-test
stats.ttest_ind(june_avg_tobs,dec_avg_tobs)

C:\Users\Admin\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3621: RuntimeWarning: Degrees of freedom <= 0 for slice
  return _methods._var(a, axis=axis, dtype=dtype, out=out, ddof=ddof,
C:\Users\Admin\anaconda3\lib\site-packages\numpy\core\_methods.py:226: RuntimeWarning: invalid value encountered in double_scalars
  ret = ret.dtype.type(ret / rcount)

Ttest_indResult(statistic=nan, pvalue=nan)

### Analysis